In [105]:
#import libraries
import pandas as pd

In [106]:
# import csv
full_name = pd.read_csv('names-single-column.csv')
full_name

                   Name
0            John Smith
1        Jane Kate Fair
2      Kristen Seaworth
3         Matt Davidson
4  Sandeep M. Junnarkar
5           Sulekha Ram
6            Krithi Ram
7         Peter Belnick
8         Pat Summerset

In [107]:
#  split value columns 
full_name = full_name["Name"].str.split(" ", n = 1, expand = True)
full_name

         0             1
0     John         Smith
1     Jane     Kate Fair
2  Kristen      Seaworth
3     Matt      Davidson
4  Sandeep  M. Junnarkar
5  Sulekha           Ram
6   Krithi           Ram
7    Peter       Belnick
8      Pat     Summerset

In [108]:
#  separate first name column  
full_name["First Name"]= full_name[0]

#  separate last name column  
full_name["Last Name"]= full_name[1]



full_name.head(4)

         0          1 First Name  Last Name
0     John      Smith       John      Smith
1     Jane  Kate Fair       Jane  Kate Fair
2  Kristen   Seaworth    Kristen   Seaworth
3     Matt   Davidson       Matt   Davidson

In [109]:
first_name = full_name['First Name']
first_name

0       John
1       Jane
2    Kristen
3       Matt
4    Sandeep
5    Sulekha
6     Krithi
7      Peter
8        Pat
Name: First Name, dtype: object

In [116]:
print(first_name.tolist())

['John', 'Jane', 'Kristen', 'Matt', 'Sandeep', 'Sulekha', 'Krithi', 'Peter', 'Pat']